pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2310.h
/* TB0IV Control Bits */
#define TBIV                             (0xffff)        /* Timer_B interrupt vector value */
#define TBIV_L                           (0x00ff)
#define TBIV_H                           (0x00ff)
#define TBIV0                            (0x0001)        /* Timer_B interrupt vector value */
#define TBIV0_L                          (0x0001)
#define TBIV1                            (0x0002)        /* Timer_B interrupt vector value */
#define TBIV1_L                          (0x0002)
#define TBIV2                            (0x0004)        /* Timer_B interrupt vector value */
#define TBIV2_L                          (0x0004)
#define TBIV3                            (0x0008)        /* Timer_B interrupt vector value */
#define TBIV3_L                          (0x0008)
#define TBIV4                            (0x0010)        /* Timer_B interrupt vector value */
#define TBIV4_L                          (0x0010)
#define TBIV5                            (0x0020)        /* Timer_B interrupt vector value */
#define TBIV5_L                          (0x0020)
#define TBIV6                            (0x0040)        /* Timer_B interrupt vector value */
#define TBIV6_L                          (0x0040)
#define TBIV7                            (0x0080)        /* Timer_B interrupt vector value */
#define TBIV7_L                          (0x0080)
#define TBIV8                            (0x0100)        /* Timer_B interrupt vector value */
#define TBIV8_H                          (0x0001)
#define TBIV9                            (0x0200)        /* Timer_B interrupt vector value */
#define TBIV9_H                          (0x0002)
#define TBIV10                           (0x0400)        /* Timer_B interrupt vector value */
#define TBIV10_H                         (0x0004)
#define TBIV11                           (0x0800)        /* Timer_B interrupt vector value */
#define TBIV11_H                         (0x0008)
#define TBIV12                           (0x1000)        /* Timer_B interrupt vector value */
#define TBIV12_H                         (0x0010)
#define TBIV13                           (0x2000)        /* Timer_B interrupt vector value */
#define TBIV13_H                         (0x0020)
#define TBIV14                           (0x4000)        /* Timer_B interrupt vector value */
#define TBIV14_H                         (0x0040)
#define TBIV15                           (0x8000)        /* Timer_B interrupt vector value */
#define TBIV15_H                         (0x0080)
#define TBIV_0                           (0x0000)        /* No interrupt pending */
#define TBIV_2                           (0x0002)        /* Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 
                                                            CCIFG; Interrupt Priority: Highest */
#define TBIV_2_L                         (0x0002)
#define TBIV_4                           (0x0004)        /* Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 
                                                            CCIFG */
#define TBIV_4_L                         (0x0004)
#define TBIV_6                           (0x0006)        /* Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 
                                                            CCIFG */
#define TBIV_6_L                         (0x0006)
#define TBIV_8                           (0x0008)        /* Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 
                                                            CCIFG */
#define TBIV_8_L                         (0x0008)
#define TBIV_10                          (0x000a)        /* Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 
                                                            CCIFG */
#define TBIV_10_L                        (0x000a)
#define TBIV_12                          (0x000c)        /* Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 
                                                            CCIFG */
#define TBIV_12_L                        (0x000c)
#define TBIV_14                          (0x000e)        /* Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL 
                                                            TBIFG; Interrupt Priority: Lowest */
#define TBIV_14_L                        (0x000e)
#define TBIV__NONE                       (0x0000)        /* No interrupt pending */
#define TBIV__TBCCR1                     (0x0002)        /* Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 
                                                            CCIFG; Interrupt Priority: Highest */
#define TBIV__TBCCR1_L                   (0x0002)
#define TBIV__TBCCR2                     (0x0004)        /* Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 
                                                            CCIFG */
#define TBIV__TBCCR2_L                   (0x0004)
#define TBIV__TBCCR3                     (0x0006)        /* Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 
                                                            CCIFG */
#define TBIV__TBCCR3_L                   (0x0006)
#define TBIV__TBCCR4                     (0x0008)        /* Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 
                                                            CCIFG */
#define TBIV__TBCCR4_L                   (0x0008)
#define TBIV__TBCCR5                     (0x000a)        /* Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 
                                                            CCIFG */
#define TBIV__TBCCR5_L                   (0x000a)
#define TBIV__TBCCR6                     (0x000c)        /* Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 
                                                            CCIFG */
#define TBIV__TBCCR6_L                   (0x000c)
#define TBIV__TBIFG                      (0x000e)        /* Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL 
                                                            TBIFG; Interrupt Priority: Lowest */
#define TBIV__TBIFG_L                    (0x000e)


/*****************************************************************************
 TB1 Registers
*****************************************************************************/

#define __MSP430_HAS_TB1__ 3                  /* Definition to show that module is available */
#ifndef __MSP430_HAS_TBx__
#define __MSP430_HAS_TBx__
#endif
#define __MSP430_BASEADDRESS_TB1__ 0x03C0
#define TB1_BASE               __MSP430_BASEADDRESS_TB1__

sfr_w(TB1CTL);                                /* Timer_B Control Register */
sfr_b(TB1CTL_L);
sfr_b(TB1CTL_H);
sfr_w(TB1CCTL0);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB1CCTL0_L);
sfr_b(TB1CCTL0_H);
sfr_w(TB1CCTL1);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB1CCTL1_L);
sfr_b(TB1CCTL1_H);
sfr_w(TB1CCTL2);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB1CCTL2_L);
sfr_b(TB1CCTL2_H);
sfr_w(TB1R);                                  /* Timer_B count register */
sfr_b(TB1R_L);
sfr_b(TB1R_H);
sfr_w(TB1CCR0);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB1CCR0_L);
sfr_b(TB1CCR0_H);
sfr_w(TB1CCR1);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB1CCR1_L);
sfr_b(TB1CCR1_H);
sfr_w(TB1CCR2);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB1CCR2_L);
sfr_b(TB1CCR2_H);
sfr_w(TB1EX0);                                /* Timer_Bx Expansion Register 0 */
sfr_b(TB1EX0_L);
sfr_b(TB1EX0_H);
sfr_w(TB1IV);                                 /* Timer_Bx Interrupt Vector Register */
sfr_b(TB1IV_L);
sfr_b(TB1IV_H);

/* TB1 Register Offsets */
#define OFS_TB1CTL                       (0x0000)
#define OFS_TB1CTL_L                     OFS_TB1CTL
#define OFS_TB1CTL_H                     OFS_TB1CTL+1
#define OFS_TB1CCTL0                     (0x0002)
#define OFS_TB1CCTL0_L                   OFS_TB1CCTL0
#define OFS_TB1CCTL0_H                   OFS_TB1CCTL0+1
#define OFS_TB1CCTL1                     (0x0004)
#define OFS_TB1CCTL1_L                   OFS_TB1CCTL1
#define OFS_TB1CCTL1_H                   OFS_TB1CCTL1+1
#define OFS_TB1CCTL2                     (0x0006)
#define OFS_TB1CCTL2_L                   OFS_TB1CCTL2
#define OFS_TB1CCTL2_H                   OFS_TB1CCTL2+1
#define OFS_TB1R                         (0x0010)
#define OFS_TB1R_L                       OFS_TB1R
#define OFS_TB1R_H                       OFS_TB1R+1
#define OFS_TB1CCR0                      (0x0012)
#define OFS_TB1CCR0_L                    OFS_TB1CCR0
#define OFS_TB1CCR0_H                    OFS_TB1CCR0+1
#define OFS_TB1CCR1                      (0x0014)
#define OFS_TB1CCR1_L                    OFS_TB1CCR1
#define OFS_TB1CCR1_H                    OFS_TB1CCR1+1
#define OFS_TB1CCR2                      (0x0016)
#define OFS_TB1CCR2_L                    OFS_TB1CCR2
#define OFS_TB1CCR2_H                    OFS_TB1CCR2+1
#define OFS_TB1EX0                       (0x0020)
#define OFS_TB1EX0_L                     OFS_TB1EX0
#define OFS_TB1EX0_H                     OFS_TB1EX0+1
#define OFS_TB1IV                        (0x002E)
#define OFS_TB1IV_L                      OFS_TB1IV
#define OFS_TB1IV_H                      OFS_TB1IV+1

